KanatERPSukhova.КанатАдаптация/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8965f225-afbc-4ff7-ac96-b5f31f39e808">
  <name>СерииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_Номенклатура</name>
    <comment>ЧТЗ ШК-1 Канат Процесс штрихкодирования</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Характеристика</name>
    <comment>ЧТЗ ШК-1 Канат Процесс штрихкодирования</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ВесЕдиницаИзмерения</name>
    <comment>ЧТЗ ШК-1 Канат Процесс штрихкодирования</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Вес</name>
    <comment>ЧТЗ ШК-1 Канат Процесс штрихкодирования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Упаковка</name>
    <comment>ЧТЗ ШК-1 Канат Процесс штрихкодирования</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/СерииНоменклатуры/Forms/ФормаЭлемента/Module.bsl
// <+БИТ> Руденков_Е.И. 22.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//ГруппаКанат
	ГруппаКанат = ЭтаФорма.Элементы.Добавить("ГруппаКанат", Тип("ГруппаФормы"),ЭтаФорма);
	ГруппаКанат.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКанат.Заголовок = "Параметры товара";
	ГруппаКанат.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаКанат.ОтображатьЗаголовок = ИСТИНА; 
	ГруппаКанат.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаКанат.РастягиватьПоГоризонтали = ИСТИНА;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_Номенклатура", Тип("ПолеФормы"),ГруппаКанат);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_Номенклатура";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_Характеристика", Тип("ПолеФормы"),ГруппаКанат);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_Характеристика";
	
	//ГруппаВес
	ГруппаВес = ЭтаФорма.Элементы.Добавить("ГруппаВес", Тип("ГруппаФормы"),ГруппаКанат);
	ГруппаВес.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВес.Заголовок = "Вес";
	ГруппаВес.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаВес.ОтображатьЗаголовок = Ложь; 
	ГруппаВес.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаВес.РастягиватьПоГоризонтали = ИСТИНА;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_Вес", Тип("ПолеФормы"),ГруппаВес);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_Вес";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_ВесЕдиницаИзмерения", Тип("ПолеФормы"),ГруппаВес);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_ВесЕдиницаИзмерения";
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 22.07.2024
